Catalogs/Теги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Теги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Теги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Модифицированность 				= Истина;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветФона 		= омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветФона);
	ТекущийОбъект.ЦветТекста 	= омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветТекста);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЦветФона 	= Новый Цвет(255, 255, 255);
		ЦветТекста 	= Новый Цвет(0, 0, 0);
	Иначе	
		ЦветФона 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветФона);
		ЦветТекста 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветТекста);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Элементы.Декорация1.Заголовок 	= ?(ПустаяСтрока(Объект.Текст), "Пример цвета.", Объект.Текст);
КонецПроцедуры


&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	Элементы.Декорация1.Заголовок 	= ?(ПустаяСтрока(Объект.Текст), "Пример цвета.", Объект.Текст);
КонецПроцедуры
